
// Метод уникален.
// 
// Параметры:
//  ИмяМетода - Строка
//  Ссылка - СправочникСсылка.мзМетоды, игнорируется при поиске дублей
// 
// Возвращаемое значение:
// 	Булево 
Функция МетодУникален(ИмяМетода, Ссылка = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	мзМетоды.Ссылка
	|ИЗ
	|	Справочник.мзМетоды КАК мзМетоды
	|ГДЕ
	|	мзМетоды.Ссылка <> &Ссылка
	|	И мзМетоды.ИмяМетода = &ИмяМетода
	|	И мзМетоды.Использование";
	Запрос.УстановитьПараметр("ИмяМетода", ИмяМетода);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции