
&НаКлиенте
Процедура ВидМетодаПриИзменении(Элемент)
	УстановитьТекущуюСтраницуПоВидуМетода();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьТекущуюСтраницуПоВидуМетода();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтраницуПоВидуМетода()
	
	Если Объект.ВидМетода = ПредопределенноеЗначение("Перечисление.мзВидыМетодов.ВызовМетода") Тогда
		Элементы.СтраницыВидыМетода.ТекущаяСтраница = Элементы.СтраницаПроизвольныйАлгоритм;
	ИначеЕсли Объект.ВидМетода = ПредопределенноеЗначение("Перечисление.мзВидыМетодов.ПроизвольныйАлгоритм") Тогда
		Элементы.СтраницыВидыМетода.ТекущаяСтраница = Элементы.СтраницаПроизвольныйАлгоритм;
		
	Иначе
		Элементы.СтраницыВидыМетода.ТекущаяСтраница = Элементы.СтраницаПусто;
	КонецЕсли;
			
КонецПроцедуры
