
Функция ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов) Экспорт

	Реквизиты = СтрРазделить(ИменаРеквизитов, ",", Ложь);
	
	ТекстЗапроса = "ВЫБРАТЬ Таб.Ссылка КАК Ссылка";
	
	Для Каждого Реквизит Из Реквизиты Цикл
		ТекстЗапроса = ТекстЗапроса + ", Таб." + Реквизит + " КАК " + Реквизит;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + " ИЗ " + Ссылка.Метаданные().ПолноеИмя() + " КАК Таб ГДЕ Таб.Ссылка =  &Ссылка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат Реквизиты;
	КонецЕсли;
		
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Для Каждого КлючЗначение Из Реквизиты Цикл
		Реквизиты.Вставить(КлючЗначение.Ключ, Выборка[КлючЗначение.Ключ]); 	
	КонецЦикла;
	
	Возврат Реквизиты;
	
КонецФункции
